# MEPAnalyticalModelData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalModelData Class
Members See Also
---
Represents the MEP analytical model data attached to individual element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class MEPAnalyticalModelData : IDisposable
```

Visual Basic
---
```text
Public Class MEPAnalyticalModelData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MEPAnalyticalModelData : IDisposable
```

# Remarks
The MEP analytical model is composed of generic analytical segments and nodes. Each Revit element may have one or more analytical segments. Connected together, these data form a network that is used in the flow and pressure drop calculation.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..MEPAnalyticalModelData
# See Also
MEPAnalyticalModelData Members
Autodesk.Revit.DB.Analysis Namespace